Repository: SayHelloGmbH/progressive-wordpress
Catalog: languages/progressive-wp-*.po
Languages: ru_ru

source: Settings saved.
ru_ru: Настройки сохранены.

source: About
ru_ru: О плагине

source: Add to homescreen
ru_ru: Добавить на рабочий стол

source: Provide an <b>integrated</b> user experience!
ru_ru: Обеспечьте <b>интегрированный</b> пользовательский интерфейс!

source: Progressive WordPress makes it easy to encourage users to add your website to their homescreen. But that's not all. It also allows you to control the display behaviour of your website so it will be shown without any browser elements. Just like a native app.
ru_ru: Progressive WordPress позволяет пользователям добавлять ваш сайт на свой рабочий стол. Но это еще не все. Он также позволяет вам контролировать поведение отображения вашего веб-сайта, чтобы он отображался без каких-либо элементов браузера. Так же, как в нативные приложения.

source: You manually set "Show add to homescreen banner" to "never".
ru_ru: Вы вручную установили "Показывать баннер" Добавить на рабочий стол" на "никогда".

source: Please select a Site Icon (Favicon).
ru_ru: Пожалуйста, выберите значок сайта (Favicon).

source: Your Site Icon should be at least 192px.
ru_ru: Значок вашего сайта должен быть не менее 192px.

source: Your Website matches the Progressive Web App criteria.
ru_ru: Ваш браузер не поддерживает прогрессивные web-приложения.

source: configure
ru_ru: конфигурировать

source: Offline usage
ru_ru: Оффлайн работа

source: Make your website <b>reliable</b>. Even on flaky internet connections!
ru_ru: Сделайте свой веб-сайт <b>надежным</b>. Даже при слабом подключении к Интернету!

source: No connection? No problem. Progressive WordPress pre-caches all critical assets of your website, as well as all visited resources. So if there's no internet connection it will serve the resources from the local storage. No more error downasaur!
ru_ru: Нет соединения? Не проблема. Progressive WordPress предварительно кэширует все важные ресурсы вашего сайта, а также все посещенные ресурсы. Поэтому, если нет интернета, сайт все равно будет работать из локального хранилища. Больше никаких оффлайн ошибок!

source: Please create and select an offline fallback page
ru_ru: Пожалуйста, создайте и выберите оффлайн страницы

source: "%s" has been selected as a page for offline fallback. Other resources will be cached automatically.
ru_ru: "%s" был выбран в качестве страницы для резервного копирования в оффлайн режиме. Другие ресурсы будут автоматически кэшироваться.

source: Push notifications
ru_ru: Push-уведомления

source: Keep your users <b>engaged</b> by sending push notifications!
ru_ru: Держите своих пользователей <b>уведомлёнными</b>, отправляя push-уведомления!

source: It looks like you are using %s to send push notifications.
ru_ru: Похоже, вы используете %s для отправки push-уведомлений.

source: Progressive WordPress is fully compatible with OneSignal!
ru_ru: Progressive WordPress полностью совместим с OneSignal!

source: You just published new content and you want to let everyone know? Why not send a push notification? Progressive WordPress has an integrated connection to Firebase that lets you manage registered devices and send push notifications to all or selected devices!
ru_ru: Вы только что опубликовали новый контент и хотите, чтобы все о нём узнали? Почему бы не отправить push-уведомление? Progressive WordPress имеет встроенное подключение к Firebase, которое позволяет управлять зарегистрированными устройствами и отправлять push-уведомления!

source: OneSignal Settings
ru_ru: OneSignal настройки

source: Please enter your Firebase cloud messaging credentials to enable push notifications.
ru_ru: Пожалуйста, введите свои учетные данные для обмена сообщениями в облаке Firebase, чтобы включить push-уведомления.

source: There are no registered devices. You might consider using the built in "Push Button".
ru_ru: Зарегистрированных устройств нет. Вы можете рассмотреть возможность использования встроенной "Кнопки".

source: All set up. Go ahead and inform your readers.
ru_ru: Все готово. Продолжайте и проинформируйте своих читателей.

source: Thank you for using %s!
ru_ru: Спасибо за использование %s!

source: This plugin was developed by %s to use progressive web app features for your WordPress website.
ru_ru: Этот плагин был разработан %s для предоставления фишек PWA для вашего WordPress сайта.

source: To deliver app-like features this plugin uses a Service Worker. This technology is not yet supported in all browsers!
ru_ru: Для работы в режиме нативного приложения плагин использует serviceWorker'ы. Данная технология не поддерживается вашим браузером!

source: If you like this plugin feel free to get involved with the development on %1$s
ru_ru: Если вам нравится этот плагин, не стесняйтесь участвовать в разработке на %1$s

source: Need Help?
ru_ru: Требуется помощь?

source: Please make sure your device supports %s.
ru_ru: Пожалуйста, убедитесь, что указанный выше статус полностью зеленый и ваше устройство поддерживает %s.

source: Still not working? Please visit the %1$1s or %2$2s.
ru_ru: Все еще не работает? Пожалуйста, посетите %1$1s или %2$2s.

source: support forum
ru_ru: форум поддержки

source: contact us
ru_ru: свяжитесь с нами

source: Download Push-Log
ru_ru: Скачать push-лог

source: Download Debug-Log
ru_ru: Скачать лог отладки

source: Welcome to the future! Progressive WordPress makes your website installable, offline ready and lets you send push notifications!
ru_ru: Добро пожаловать в будущее! Progressive WordPress делает ваш сайт доступным для установки, готовым к работе в автономном режиме и позволяет отправлять push-уведомления!

source: Configure
ru_ru: Сконфигурировать

source: %s Version 2.0 is here!
ru_ru: %s Версия 2.0 уже здесь!

source: We are more than happy to announce the biggest update so far! To make it short, we had one big goal: to rewrite the plugin so it fits the needs of non-Developers while it stays very flexble and easy to extend!
ru_ru: Мы более чем рады объявить о самом большом обновлении на сегодняшний день! Короче говоря, у нас была одна большая цель: переписать плагин так, чтобы он соответствовал потребностям не разработчиков, оставаясь при этом очень гибким и простым в расширении!

source: explore changes
ru_ru: изучить изменения

source: An unexpected error occured
ru_ru: Произошла непредвиденная ошибка

source: Make your website installable!
ru_ru: Сделайте ваш сайт устанавливаемым!

source: With this feature you are able to display an "add to homescreen" prompt. This way your website gets a prominent place on the users home screen right next to the native apps.
ru_ru: С помощью этой функции вы можете отобразить уведомление "добавить на рабочий стол". Таким образом, ваш веб-сайт займет видное место на главном экране пользователя рядом с собственными приложениями.

source: Normal
ru_ru: Нормально

source: The browser will show a mini-infobar which opens the install promt
ru_ru: В браузере появится мини-информационная панель, которая откроет приглашение на установку

source: On element click
ru_ru: Нажмите на элемент

source: Define an element as an install-prompt trigger
ru_ru: Определите элемент в качестве триггера запроса на установку

source: Never
ru_ru: Никогда

source: This will override the display mode to `browser`, so the browser will not try to add an install-prompt
ru_ru: Это изменит режим отображения на "браузер", поэтому браузер не будет пытаться добавить приглашение на установку

source: Show "add to homescreen" banner
ru_ru: Показать баннер "добавить на рабочий стол"

source: Number of pageloads
ru_ru: Количество загрузок страниц

source: Element
ru_ru: Элемент

source: should be a jQuery selector (.my-click-element)
ru_ru: должен быть селектор jQuery (.my-click-element)

source: As soon as your web app can be installed, a class `installable-active` will be added to this element and the prompt will be shown on click.
ru_ru: Как только ваше веб-приложение будет установлено, к этому элементу будет добавлен класс "installable-active", и при нажатии на него появится приглашение.

source: This values are used to create a manifest.json file, which then controls the appearance of you progressive web app.
ru_ru: Эти значения используются для создания файла manifest.json, который предоставляет данные для установки вашего веб-сайта.

source: Read all about the web app manifest:.
ru_ru: Прочитайте о PWA манифесте.

source: Homescreen values
ru_ru: Параметры приложения

source: Name
ru_ru: Имя

source: Short Name
ru_ru: Короткое название

source: max. 12 Chars
ru_ru: не более 12 символов

source: Start Page
ru_ru: Начальная страница

source: AMP Start Page
ru_ru: AMP начальная страница

source: Use the AMP Version of the Start Page if available.
ru_ru: Используйте версию AMP начальной страницы, если она доступна.

source: Description
ru_ru: Описание

source: Customizer -> Site Icon
ru_ru: Настройки -> Иконка сайта

source: This Option has been removed. Please use the Site Icon from the customizer instead: %s.
ru_ru: Эта опция была удалена. Пожалуйста, используйте вместо этого значок сайта в настройщике: %s.

source: Icon
ru_ru: Иконка

source: Fullscreen - App takes whole display
ru_ru: Fullscreen - приложение занимает весь дисплей

source: Standalone - Native App feeling
ru_ru: Standalone - Нативное приложение

source: Minimal browser controls
ru_ru: Минимум браузерных кнопок

source: Display mode
ru_ru: Режим отображения

source: possible display modes
ru_ru: доступные режимы отображения

source: Orientation
ru_ru: Ориентация

source: Both
ru_ru: Оба

source: Landscape
ru_ru: Альбомный

source: Portrait
ru_ru: Вертикально

source: Theme Color
ru_ru: Цвет темы

source: Background Color
ru_ru: Цвет фона

source: Sorry, you are not allowed to edit the manifest.
ru_ru: Извините, вам не разрешено редактировать манифест.

source: Stale While Revalidate
ru_ru: Стратегия "старое - лучше нового"

source: Network First
ru_ru: Из сети первоочередное

source: Cache First
ru_ru: Кэш первоочередное

source: Network Only
ru_ru: Только сеть

source: This feature allows you to provide offline usage for your website.
ru_ru: Это позволяет использовать ваш сайт даже в оффлайн режиме.

source: By default, a copy of each page is stored in the browser cache as the visitor views it. This allows a visitor to load any previously viewed page while they are offline. The plugin also defines a special “offline page”, which allows you to customize a message and the experience if the app is offline and the page is not in the cache. Additionally, you can define other pre-cached resources using the "offline content" textarea.
ru_ru: Копия каждой страницы сохраняется в кэше браузера по мере ее просмотра пользователем. Это позволяет пользователю загружать любую ранее просмотренную страницу, пока он находится в автономном режиме. Плагин также определяет специальную “автономную страницу”, которая позволяет настраивать сообщение и взаимодействие, если приложение находится в автономном режиме, а страница отсутствует в кэше.

source: Offline Usage
ru_ru: Оффлайн работа

source: This page should contain a message explaining why the requested content is not available.
ru_ru: Эта страница должна содержать сообщение, объясняющее, почему запрошенный контент недоступен.

source: Pages and files that should be saved for offline usage on first interaction. One URL per line.
ru_ru: Pages and files that should be saved for offline usage on first interaction. One URL per line. Страницы и файлы, которые должны быть сохранены для оффлайн режима. Одна ссылка - одна строчка.

source: Every URL has to start with: %1$s
ru_ru: Каждая URL будет начинаться с: %1$s

source: Offline Content
ru_ru: Оффлайн контент

source: Offline Google Analytics
ru_ru: Оффлайн работа активирована

source: If the user is offline, analytics data can't be sent to google analytcs. This option will store the data and sync them as soon as the user is online again.
ru_ru: Если пользователь в оффлайне, то данные не будет отправлены в Google analutics. Опция позволяет сохранить данные и синхронизировать их, когда появится соединение.

source: All network requests are cached by progressive WordPress. Here you are able to manually change the caching strategy for some request types.
ru_ru: Progressive WordPress кэширует все интернет-запросы. Вы можете выбрать метод работы с кэшом.

source: This strategy will use a cached response for a request if it is available and update the cache in the background with a response form the network. (If it’s not cached it will wait for the network response and use that). This is a fairly safe strategy as it means users are regularly updating their cache. The downside of this strategy is that it’s always requesting an asset from the network, using up the user’s bandwidth.
ru_ru: Эта стратегия будет использовать сначала кэш, если он доступен, и обновлять данные в фоновом режиме из сети. Если кэша нет, то он будет ждать данные из сети и использовать их. Это довольно безопасная стратегия, поскольку она означает, что пользователи регулярно обновляют свой кэш. Недостатком этой стратегии является то, что она всегда запрашивает ресурс из сети, используя пропускную способность пользователя.

source: This will try and get a request from the network first. If it receives a response, it’ll pass that to the browser and also save it to a cache. If the network request fails, the last cached response will be used.
ru_ru: Позволяет сначала попробовать получить данные из сети. Если данные есть, то они будут использованы, а также сохранятся в кэш. Если сеть не работает, то будут использованы последние закэшированные данные.

source: This strategy will check the cache for a response first and use that if one is available. If the request isn’t in the cache, the network will be used and any valid response will be added to the cache before being passed to the browser.
ru_ru: Сначала будет запрошен кэш и, если он есть, то будет использован. Если кэша нет, будет использована сеть, и любой допустимый ответ будет добавлен в кэш перед передачей в браузер.

source: This strategy won't chache anything. The network will be used and the response will be passed directly to the browser (That's how the browser would handle the request without the Service Worker).
ru_ru: Эта стратегия ничего не кэширует. Будет использоваться сеть, и данные будут переданы непосредственно браузеру (именно так браузер будет обрабатывать запрос без ServiceWorker'а).

source: Caching strategies
ru_ru: Стратегии кэширования

source: This adds a little notice which will be displayed if the device is offline.
ru_ru: Это добавляет небольшое уведомление, которое будет отображаться, если устройство находится в оффлайне.

source: offline indicator
ru_ru: оффлайн индикатор

source: Offline indicator
ru_ru: Оффлайн индикатор

source: Message
ru_ru: Сообщение

source: Position
ru_ru: Расположение

source: Bottom
ru_ru: Кнопка

source: Top
ru_ru: Верх

source: Textcolor
ru_ru: Цвет текста

source: Background-Color
ru_ru: Цвет фона

source: Default caching strategy
ru_ru: Стратегия кэширования по-умолчанию

source: Caching strategy for CSS and JS Files
ru_ru: Метод кэширования для CSS и JS файлов

source: Caching strategy for images
ru_ru: Метод кэширования для изображений

source: Caching strategy for fonts
ru_ru: Метод кэширования для шрифтов

source: Caching strategy for WP Rest
ru_ru: Метод кэширования для WP Rest

source: Push Notification settings
ru_ru: Настройки Push-уведомлений

source: Remove devices if failed once
ru_ru: Удалить устройство при первом сбое

source: Notification Bar Icon
ru_ru: Иконка уведомления

source: This image will represent the notification when there is not enough space to display the notification itself such as, for example, the Android Notification Bar. It will be automatically masked. For the best result use a single-color graphic with transparent background.
ru_ru: Это изображение будет представлять уведомление, когда не хватает места для отображения самого уведомления, такого как, например, панель уведомлений Android. Он будет автоматически замаскирован. Для достижения наилучшего результата используйте одноцветную графику с прозрачным фоном.

source: Has to be at least 92x92px
ru_ru: Должно быть не менее 92x92 пикселей

source: This adds a fixed push notification button to the bottom of your page.
ru_ru: Это добавить зафиксированную кнопку push-уведомлений вниз страницы.

source: Push Button
ru_ru: Кнопка уведомления

source: Add notification button
ru_ru: Кнопка добавления уведомления

source: Button appearance
ru_ru: Внешний вид кнопки

source: Icon color
ru_ru: Цвет иконки

source: Background color
ru_ru: Цвет фона

source: Send to all devices
ru_ru: Отправить на все устройства

source: Device
ru_ru: Устройство

source: Registered
ru_ru: Зарегистрировано

source: No devices registered
ru_ru: Ни одного устройства не зарегистрировано

source: Browser
ru_ru: Браузер

source: Remove device
ru_ru: Удалить устройство

source: Devices
ru_ru: Устройства

source: Device could not be removed.
ru_ru: Устройство не удалось удалить.

source: Device could not be registered.
ru_ru: Устройство не удалось зарегистрировать.

source: Logfile could not be created
ru_ru: Не удалось создать лог

source: Error
ru_ru: Ошибка

source: Title
ru_ru: Заголовок

source: Body
ru_ru: Содержимое

source: Image
ru_ru: Картинка

source: Create push notification
ru_ru: Создать push-уведомление

source: New Push-Notification
ru_ru: Новое push-уведомление

source: This notification will be sent to the selected device.
ru_ru: Это уведомление будет отправлено на выбранное устройство.

source: upload image
ru_ru: загрузить изображение

source: remove image
ru_ru: удалить изображение

source: Send push
ru_ru: Отправить push-уведомлени

source: Notifications have been sent
ru_ru: Уведомления были отправлены

source: Invalid firebase server key
ru_ru: Неверный firebase server key

source: No devices set
ru_ru: Нет набора устройств

source: Could not write latest_push_json
ru_ru: Не удалось записать latest_push_json

source: This plugin uses Firebase Cloud Messaging as a messaging service.
ru_ru: Этот плагин использует облачные сообщения Firebase в качестве службы обмена сообщениями.

source: Go to %s
ru_ru: Перейти на %s

source: Click "create new project"
ru_ru: Нажмите "create new project"

source: Follow the instructions to create your project
ru_ru: Следуйте инструкции по созданию нового проекта

source: Now navigate to Project setting page
ru_ru: Теперь перейдите в Project setting

source: Navigate to Cloud Messaging Tab
ru_ru: Перейдите во вкладку Cloud Messaging

source: There you will get two important key’s "Server Key" and "Sender Id"
ru_ru: Вы должны получить два важных ключа - "Server Key" и "Sender Id"

source: remove credentials
ru_ru: удалить учетные данные

source: Access denied.
ru_ru: В доступе отказано.

source: Server Key or Sender ID could not be verified.
ru_ru: Server Key или Sender ID не были верифицированы.

source: This function opens the push notification modal for this post.
ru_ru: Эта функция открывает push-уведомление для этого поста.

source: Push notification has already been sent. Do you want to send it again?
ru_ru: Push-уведомление уже отправлено. Вы хотите отправить его снова?

source: Are you sure you want to send a new push notification?
ru_ru: Вы уверены, что хотите отправить новое push-уведомление?

source: Send again
ru_ru: Отправить снова

source: This will add a meta box to the post edit screen, where you can easily send a push notification for this post.
ru_ru: Это добавит метабокс на экран редактирования поста, где вы можете легко отправить push-уведомление для этого поста.

source: %s will be replaced with the post title.
ru_ru: %s будет заменено название поста.

source: Push Post
ru_ru: Автоматическое push-уведомление новой публикации

source: Push Post for "%s"
ru_ru: Push-уведомление для "%s"

source: %s: Title
ru_ru: %s: Заголовок

source: %s: Body
ru_ru: %s: Содержимое

source: New %s published!
ru_ru: Новое %s опубликовано!

source: Your site has to be served over https to use progressive web app features.
ru_ru: Ваш сайт должен работать по защищённому протоколу HTTPS, чтобы поддерживать все функции PWA.

source: Start URL tracking
ru_ru: Стартовая ссылка

source: %s will be added to the start URL
ru_ru: %s будет заменено название поста

source: %s will be added to the push notification redirect URL
ru_ru: %s будут добавлены в URL-адрес перенаправления push-уведомлений

source: Campaign Source
ru_ru: Источник кампании

source: The referrer: (e.g. google, newsletter)
ru_ru: Реферер: (например, google, рассылка новостей)

source: Campaign Medium
ru_ru: Средство проведения Кампании

source: Marketing medium: (e.g. cpc, banner, email)
ru_ru: Маркетинговая среда: (например, cpc, баннер, электронная почта)

source: Campaign Name
ru_ru: Название кампании

source: Product, promo code, or slogan (e.g. spring_sale)
ru_ru: Продукт, промо-код или слоган (например, spring_sale)

source: Campaign Term
ru_ru: Срок проведения кампании

source: Campaign Content
ru_ru: Оффлайн контент

source: Use to differentiate ads
ru_ru: Используйте для дифференциации рекламы

source: Add to Homescreen
ru_ru: Добавить на рабочий стол

source: Push Notifications
ru_ru: Push-уведомления

source: “%1$s” requires PHP %2$s (or newer) and WordPress %3$s (or newer) to function properly. Your site is using PHP %4$s and WordPress %5$s. Please upgrade. The plugin has been automatically deactivated.
ru_ru: “%1$s” требуется PHP версии %2$s (или новее) и WordPress %3$s (или новее) для полной работоспособности. Ваш сайт работает на PHP %4$s и WordPress %5$s. Пожалуйста обновитесь. Плагин был автоматически отключен.

source: https://github.com/SayHelloGmbH/progressive-wordpress
ru_ru: https://github.com/nico-martin/progressive-wordpress

source: Turn your website into a Progressive Web App and make it installable, offline ready and send push notifications.
ru_ru: Сделайте из вашего сайта прогрессивное web-приложение (PWA), это позволит: устанавливать ваш сайт как обычное приложение, работать оффлайн и отправлять push-уведомления.

source: Nico Martin
ru_ru: Нико Мартин
